export const REASONS_TO_DEPLOY = [
	'กดไปสิ รออะไร',
	'คุณได้สิทธิ์นั้นเดี๋ยวนี้',
	'จัดไปเลยเพื่อน',
	'ลุย',
	'กดเลย ผมรับผิดชอบเอง 🔥',
	'ไป ไป ไป ไป!',
	'โอกาสแบบนี้ไม่ได้มีบ๊อยบ่อย',
	'ส่งฮอลคูลไป ❄️',
	'ปล่อยไปตามหัวใจ',
	'เอาเลย',
	'จัดไปแบบเบิ้มๆ',
	'โอเค',
	'ไม่มีไรหรอก แก้นิดเดียว',
	'พังก็แค่แก้ เรื่องจิ๊บๆ',
	'ไปเทสต์บน Production กันเถอะ',
	'LGTM',
	'ใส่เต็มข้อ ล่อเต็มแข้ง',
	'👍👍👍',
	'เห็นควรด้วย',
	'คนเราเกิดหนเดียว ตายหนเดียว'
];

export const REASONS_TO_NOT_DEPLOY = [
	'ไม่แนะนำให้ Deploy วันนี้',
	'ไม่ล่ะ วันนี้วันศุกร์นะ',
	'Deploy วันจันทร์แทนดีไหม',
	'ไม่',
	'ม่ายยยยย',
	'ทำไมล่ะ?',
	'เทสต์ผ่านหรือยัง?',
	'¯\\_(ツ)_/¯',
	'😹',
	'มั่ย',
	'ไม่ หายใจเข้าลึกๆ นับหนึ่งถึงสิบ แล้วลองใหม่',
	'ไปกินไอติมดีกว่าม้าง 🍦',
	'ต่อหน้าฉันเธอทำอย่างนั้นได้อย่างไร? 🥺'
];

export const REASONS_FOR_WEEKEND = [
	'เมาแล้ว กลับบ้านเถอะ',
	'Deploy วันจันทร์แทนดีไหม',
	'กินเบียร์ไหม?',
	'การดื่มสุราทำให้สมรรถภาพเสื่อม',
	'Deploy วันศุกร์ไปแล้วสินะ',
	'บอกแล้วว่า Deploy วันจันทร์ก็ไม่เชื่อ',
	'วันพระวันเจ้าไม่เว้นกันเล้ยยยย'
];
