export const REASONS_TO_DEPLOY = [
	'กดไปสิ รออะไร',
	'คุณได้สิทธิ์นั้นเดี๋ยวนี้',
	'จัดไปเลยเพื่อน',
	'ลุย',
	'กดเลย ผมรับผิดชอบเอง 🔥',
	'ไป ไป ไป ไป!',
	'โอกาสแบบนี้ไม่ได้มีบ๊อยบ่อย',
	'ส่งฮอลคูลไป ❄️',
	'ปล่อยไปตามหัวใจ',
	'เอาเลย',
	'จัดไปแบบเบิ้มๆ',
	'โอเค',
	'ไม่มีไรหรอก แก้นิดเดียว',
	'พังก็แค่แก้ เรื่องจิ๊บๆ',
	'ไปเทสต์บน Production กันเถอะ',
	'LGTM',
	'ใส่เต็มข้อ ล่อเต็มแข้ง',
	'👍👍👍',
	'เห็นควรด้วย',
	'คนเราเกิดหนเดียว ตายหนเดียว'
];

export const COMMON_REASONS_TO_NOT_DEPLOY = [
	'ยังอยากนอนอยู่ไหม?',
	'ถามเพื่อนก่อน',
	'อยากยิงยาวเรอะวันนี้?',
	'บอกหัวหน้าว่าเจอบั๊ัก แล้วกลับบ้านเถอะ',
	'ไม่แนะนำ',
	'ไม่ใช่วันนี้',
	'เอาจริงเหรอ คิดใหม่ได้นะ',
	'มั่ย',
	'ไม่ หายใจเข้าลึกๆ นับหนึ่งถึงสิบ แล้วลองใหม่',
	'ไม่แนะนำให้ Deploy วันนี้',
	'ไม่',
	'ม่ายยยยย',
	'ทำไมล่ะ?',
	'เทสต์ผ่านหรือยัง?',
	'¯\\_(ツ)_/¯',
	'😹',
	'🤯🤯🤯',
	'ไปกินไอติมดีกว่าม้าง 🍦',
	'ต่อหน้าฉันเธอทำอย่างนั้นได้อย่างไร? 🥺',
	'ใจร่มๆ นะ',
	'บ้าไปแล้วเหรอ',
	'คิดยังไง ถึงอยากทำงานวันหยุดต่อน่ะ',
	'เฮ้ย ตื่นๆ',
	'ใจเย็นๆ',
	'รับผิดชอบเองนะ'
];

export const FRIDAY_REASONS = [
	...COMMON_REASONS_TO_NOT_DEPLOY,
	'ไม่ล่ะ วันนี้วันศุกร์นะ',
	'Deploy วันจันทร์แทนดีไหม?',
	'Deploy วันจันทร์สิ มีเวลาแก้ถึงวันศุกร์นู่น'
];

export const WEEKEND_REASONS = [
	...COMMON_REASONS_TO_NOT_DEPLOY,
	'เมาแล้ว กลับบ้านเถอะ',
	'Deploy วันจันทร์แทนดีไหม?',
	'กินเบียร์แทนไหม?',
	'การดื่มสุราทำให้สมรรถภาพเสื่อม',
	'Deploy วันศุกร์ไปแล้วสินะ เลยต้องมาแก้วันหยุดแบบนี้ไง',
	'บอกแล้วว่า Deploy วันจันทร์ก็ไม่เชื่อ',
	'Deploy วันจันทร์สิ มีเวลาแก้ถึงวันศุกร์นู่น',
	'วันพระวันเจ้าไม่เว้นกันเล้ยยยย'
];
